---
kind: type
id: T:Autodesk.Revit.DB.FailureSeverity
source: html/d0cdffe3-22c5-b764-8090-5104f044b000.htm
---
# Autodesk.Revit.DB.FailureSeverity

Enum represents severity of a failure.

## Syntax (C#)
```csharp
public enum FailureSeverity
```